Repository: encode/django-rest-framework
Catalog: rest_framework/locale/*/LC_MESSAGES/django.po
Languages: id, kk, ky, vi

source: navbar
kk: навигация панелі
ky: навбар
vi: thanh điều hướng

source: content
id: konten
kk: мазмұн
ky: контент
vi: nội dung

source: request form
id: form permintaan
kk: сұрау формасы
ky: суроо формасы
vi: form yêu cầu

source: main content
id: konten utama
kk: негізгі бөлім
ky: негизги контент
vi: nội dung chính

source: request info
id: info permintaan
kk: сұрау ақпараты
ky: суроо маалыматы
vi: thông tin yêu cầu

source: response info
id: info tanggapan
kk: жауап ақпараты
ky: жооп маалыматы
vi: thông tin phản hồi

source: None
id: Tidak ada
kk: Ешқайсысы
vi: Không

source: No items to select.
id: Tidak ada item untuk dipilih.
kk: Таңдайтын элементтер жоқ.
ky: Тандоого эч нерсе жок.
vi: Không có gì để chọn.

source: This field must be unique.
id: Bidang ini harus unik.
kk: Бұл енгізу жолы бірегей болуы керек.
ky: Бул талаа уникалдуу болушу керек.
vi: Trường này phải duy nhất.

source: The fields {field_names} must make a unique set.
id: Bidang {field_names} harus membuat kumpulan yang unik.
kk: {field_names} енгізу жолдары бірегей жинақ құрауы тиіс.
ky: {field_names} талаалары чогуу уникалдуу болушу керек.
vi: Các trường {field_names} phải là một tập duy nhất.

source: Surrogate characters are not allowed: U+{code_point:X}.
id: Karakter pengganti tidak diperbolehkan: U+{code_point:X}.
kk: Суррогат таңбалар рұқсат етілмейді: U+{code_point:X}.
ky: өгөй белгилерге уруксат жок: U+{code_point:X}.
vi: Không cho phép các ký tự thay thế: U+{code_point:X}.

source: This field must be unique for the "{date_field}" date.
id: Bidang ini harus unik untuk tanggal "{date_field}".
kk: "{date_field}" күніне бұл енгізу жолы бірегей болуы керек.
ky: Бул талаа "{date_field}" күнүнө карата уникалдуу болушу керек.
vi: Trường này phải là duy nhất cho ngày "{date_field}".

source: This field must be unique for the "{date_field}" month.
id: Kolom ini harus unik untuk bulan "{date_field}".
kk: "{date_field}" айына бұл енгізу жолы бірегей болуы керек.
ky: Бул талаа "{date_field}" айына карата уникалдуу болушу керек.
vi: Trường này phải là duy nhất cho tháng "{date_field}".

source: This field must be unique for the "{date_field}" year.
id: Kolom ini harus unik untuk tahun "{date_field}".
kk: "{date_field}" жылына бұл енгізу жолы бірегей болуы керек.
ky: Бул талаа "{date_field}" жылына карата уникалдуу болушу керек.
vi: Trường này phải là duy nhất cho năm "{date_field}".

source: Invalid version in "Accept" header.
id: Versi tidak valid di header "Accept".
kk: "Accept" тақырыбында нұсқа дұрыс көрсетілмеген.
ky: "Accept" хэдэринде жарамсыз версия.
vi: Phiên bản "Accept" header không hợp lệ.

source: Invalid version in URL path.
id: Versi tidak valid di path URL.
kk: URL жолында нұсқа қате көрсетілген.
ky: URL жолунда жарамсыз версия.
vi: Phiên bản không hợp lệ trong đường dẫn URL.

source: Invalid version in URL path. Does not match any version namespace.
id: Versi tidak valid di path URL. Tidak cocok dengan namespace versi apa pun.
kk: URL жолында нұсқа дұрыс көрсетілмеген. Ешбір нұсқа кеңістігімен сәйкес келмейді.
ky: Invalid version in URL path. Эч бир версия аталыш мейкиндигине дал келбеди.
vi: Phiên bản không hợp lệ đường dẫn URL. Không trùng với bất cứ tên miền.

source: Invalid version in hostname.
id: Versi tidak valid dalam nama host.
kk: Хост атауында нұсқа қате көрсетілген.
ky: hostname де жарамсыз версия.
vi: Phiên bản không hợp lệ trong tên máy chủ.

source: Invalid version in query parameter.
id: Versi tidak valid dalam parameter kueri.
kk: Сұраныс параметрінде нұсқа қате көрсетілген.
ky: суроо параметринде жарамсыз версия.
vi: Phiên bản không hợp lệ trong các tham số truy vấn.
