Repository: encode/django-rest-framework
Catalog: rest_framework/locale/*/LC_MESSAGES/django.po
Languages: id, kk, ky, vi

source: Invalid basic header. No credentials provided.
id: Header dasar tidak valid. Tidak ada kredensial yang diberikan.
kk: Негізгі тақырыптама дұрыс емес. Тіркелгі деректері берілмеген.
ky: Жарамсыз негизги хэдэр. Каттоо маалыматтары берилбеди
vi: Basic header không hợp lệ. Không có thông tin đăng nhập nào được cung cấp.

source: Invalid basic header. Credentials string should not contain spaces.
id: Header dasar tidak valid. String kredensial tidak boleh berisi spasi.
kk: Негізгі тақырыптама дұрыс емес. Тіркелгі деректері бос орындарсыз болуы керек.
ky: Жарамсыз негизги хэдэр. Каттоо маалыматтары боштук камтыбаш керек.
vi: Basic header không hợp lệ. Chuỗi thông tin đăng nhâp không được bao gồm các dấu cách.

source: Invalid basic header. Credentials not correctly base64 encoded.
id: Header dasar tidak valid. Kredensial tidak dikodekan oleh base64 dengan benar.
kk: Негізгі тақырыптама дұрыс емес. Тіркелгі деректері base64 форматында дұрыс кодталмаған.
ky: Жарамсыз негизги хэдэр. Каттоо маалыматтары туура эмес base64 шифрленген
vi: Basic header không hợp lệ. Thông tin đăng nhập không được mã hóa đúng theo chuẩn base64.

source: Invalid username/password.
id: Nama pengguna atau kata sandi tidak valid.
kk: Қате пайдаланушы аты немесе құпиясөз.
ky: Жарамсыз колдонуучу аты / сырсөз
vi: Sai tên đăng nhập hoặc mật khẩu.

source: User inactive or deleted.
id: Pengguna tidak akfif atau telah dihapus.
kk: Пайдаланушы өшірулі немесе жойылған.
ky: Колдонуучу активдүү эмес же өчүрүлгөн.
vi: Người dùng không còn hoạt động, hoặc đã bị xoá.

source: Invalid token header. No credentials provided.
id: Header token tidak valid. Tidak ada kredensial yang diberikan.
kk: Токен тақырыптамасы дұрыс емес. Тіркелгі деректері берілмеген.
ky: Жарамсыз токен хэдэри. Каттоо маалыматтары берилген эмес.
vi: Token header không hợp lệ. Không có thông tin đăng nhập nào được cung cấp.

source: Invalid token header. Token string should not contain spaces.
id: Header token tidak valid. String token tidak boleh berisi spasi.
kk: Токен тақырыптамасы дұрыс емес. Токен жолында бос орын болмауы керек.
ky: Жарамсыз негизги хэдэр. Токен сабы боштук камтыбаш керек.
vi: Token header không hợp lệ. Chuỗi token không được bao gồm các dấu cách.

source: Invalid token header. Token string should not contain invalid characters.
id: Header token tidak valid. String token tidak boleh berisi karakter yang tidak valid.
kk: Токен тақырыптамасы дұрыс емес. Токен құрамында жарамсыз таңбалар болмауы керек.
ky: Жарамсыз негизги хэдэр. Токен сабы жарамсыз символдорду камтыбаш керек.
vi: Token header không hợp lệ. Chuỗi token không được bao gồm các ký tự không hợp lệ.

source: Invalid token.
id: Token tidak valid.
kk: Жарамсыз токен.
ky: Жарамсыз токен.
vi: Token không hợp lệ.

source: Username
id: Nama pengguna
kk: Пайдаланушы аты
ky: Колдонуучу аты
vi: Tên người dùng

source: Auth Token
id: Token Autentikasi
kk: Аутентификация токені
ky: Аутентикация Токени
vi: Token xác thực

source: Key
id: Kunci
kk: Кілт
ky: Ачкыч
vi: Khoá

source: User
id: Pengguna
kk: Пайдаланушы
ky: Колдонуучу
vi: Người dùng

source: Created
id: Dibuat
kk: Құрылған
ky: Түзүлгөн
vi: Đã tạo

source: Token
kk: Токен
ky: Токен

source: Tokens
id: Token
kk: Токендер
ky: Токендер
vi: Các token

source: Password
id: Kata sandi
kk: Құпиясөз
ky: Сырсөз
vi: Mật khẩu

source: Unable to log in with provided credentials.
id: Tidak dapat masuk dengan kredensial yang diberikan.
kk: Берілген тіркелгі деректерімен кіру мүмкін емес.
ky: Көрсөтүлгөн каттоо маалыматтары менен кирүүгө мүмкүн эмес.
vi: Không thể đăng nhập với thông tin đã nhập.

source: Must include "username" and "password".
id: Harus menyertakan "nama pengguna" dan "kata sandi".
kk: "username" мен "password" енгізілуі керек.
ky: "username" жана "password" камтылышы абзел
vi: Bắt buộc phải có “tên người dùng” và “mật khẩu”.

source: A server error occurred.
id: Terjadi kesalahan server.
kk: Серверде қате орын алды.
ky: Серверде ката кетти.
vi: Xảy ra lỗi trên máy chủ.

source: Invalid input.
id: Masukan tidak valid.
kk: Қате енгізу деректері.
ky: Туура эмес терилди.
vi: Đầu vào không hợp lệ.

source: Malformed request.
id: Permintaan rusak.
kk: Сұраныс дұрыс құрылмаған.
ky: Бузулган суроо талап.
vi: Yêu cầu không đúng định dạng.

source: Incorrect authentication credentials.
id: Kredensial autentikasi salah.
kk: Аутентификация деректері қате.
ky: Жарамсыз аутентификация маалыматтары.
vi: Thông tin xác thực không chính xác.

source: Authentication credentials were not provided.
id: Kredensial autentikasi tidak diberikan.
kk: Аутентификация деректері берілмеген.
ky: Аутентификация каттоо маалыматтары көрсөтүлгөн эмес.
vi: Thông tin xác thực không được cung cấp.

source: You do not have permission to perform this action.
id: Anda tidak memiliki izin untuk melakukan tindakan ini.
kk: Бұл әрекетті орындауға рұқсатыңыз жоқ.
ky: Сиз бул аракетти аткарууга жеткиңиз жок.
vi: Bạn không được cấp quyền để thực hiện hành động này.

source: Not found.
id: Tidak ditemukan.
kk: Табылмады.
ky: Табылган жок.
vi: Không tìm thấy.

source: Method "{method}" not allowed.
id: Metode "{method}" tidak diperbolehkan.
kk: "{method}" әдісіне рұқсат етілмейді.
ky: "{method}" методуна уруксат эмес.
vi: Phương thức “{method}” không được chấp nhận.

source: Could not satisfy the request Accept header.
id: Tidak dapat memenuhi permintaan Accept header.
kk: Сұраныстағы Accept тақырыбын қанағаттандыру мүмкін емес.
ky: суроонун Accept хэдэрин канааттандыра албады.

source: Unsupported media type "{media_type}" in request.
id: Jenis media "{media_type}" yang diminta tidak didukung.
kk: Сұраныстағы "{media_type}" медиа түрі қолдау көрсетілмейді.
ky: Колдоого алынбаган "{media_type}" медиа тиби.
vi: Loại dữ liệu đa phương tiện "{media_type}" không được hỗ trợ.

source: Request was throttled.
id: Permintaan ini telah dibatasi.
kk: Сұраныс жиілігі шектелді.
ky: Суроо өчүрүлүп калды.
vi: Yêu cầu đã bị giới hạn.

source: Expected available in {wait} second.
id: Diharapkan tersedia dalam {wait} detik.
kk: {wait} секундтан кейін қайта қолжетімді болады.
ky: {wait} секундада жеткиликтүү болот.
vi: Dự kiến khả dụng trong {wait} giây.

source: Expected available in {wait} seconds.
id: Diharapkan tersedia dalam {wait} detik.
kk: {wait} секундтан кейін қайта қолжетімді болады.
ky: {wait} секундада жеткиликтүү болот.
vi: Dự kiến khả dụng trong {wait} giây.

source: This field is required.
id: Bidang ini harus diisi.
kk: Бұл мән міндетті.
ky: Бул талаа керектүү.
vi: Trường này là bắt buộc.

source: This field may not be null.
id: Bidang ini tidak boleh diisi dengan null.
kk: Бұл мән null болмауы керек.
ky: Бул талаа нулл болушу мүмкүн эмес.
vi: Trường này không được bằng null.

source: Must be a valid boolean.
id: Harus berupa boolean yang valid.
kk: Дұрыс логикалық мән болуы керек.
ky: Жарактуу булеан болушу керек.
vi: Phải là giá trị boolean hợp lệ.

source: Not a valid string.
id: Bukan string yang valid.
kk: Мәтін дұрыс емес.
ky: Жарамсыз стринг.
vi: Không phải một chuỗi hợp lệ.

source: This field may not be blank.
id: Bidang ini tidak boleh kosong.
kk: Бұл мән бос болмауы керек.
ky: Бул талаа бош болбош керек.
vi: Trường này không được bỏ trống.

source: Ensure this field has no more than {max_length} characters.
id: Pastikan bagian ini tidak lebih dari {max_length} karakter.
kk: Бұл мән ең көбі {max_length} таңбадан аспауы керек.
ky: Бул талаа {max_length} симводон көп эмес экенин текшериңиз.
vi: Đảm bảo trường này không có nhiều hợp {max_length} ký tự.

source: Ensure this field has at least {min_length} characters.
id: Pastikan bagian ini memiliki setidaknya {min_length} karakter.
kk: Бұл мән кемінде {min_length} таңба болуы керек.
ky: Бул талаа {min_length} симводон аз эмес экенин текшериңиз.
vi: Đảm bảo trường này có ít nhất {min_length} ký tự.

source: Enter a valid email address.
id: Masukkan alamat email dengan benar.
kk: Дұрыс электрондық пошта енгізіңіз.
ky: Жарактуу эпочта дарегин териңиз.
vi: Nhập một địa chỉ email hợp lệ.

source: This value does not match the required pattern.
id: Nilai ini tidak sesuai dengan pola yang dibutuhkan.
kk: Бұл мән қажетті үлгіге сәйкес келмейді.
ky: Бул маани керектүү калыпка түшпөдү.
vi: Giá trị này không khớp với mẫu được yêu cầu.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
id: Masukkan "slug" valid yang terdiri dari huruf, angka, garis bawah atau tanda hubung.
kk: Әріптерден, сандардан, астын сызу және сызықшалардан тұратын дұрыс "slug" енгізіңіз.
ky: Жарактуу арип, сан, астыңкы сызык жана дефисти камтыган "slug" киргизиңиз.
vi: Nhập một "slug" hợp lệ bao gồm các chữ cái, số, dấu gạch dưới hoặc dấu gạch nối.

source: Enter a valid "slug" consisting of Unicode letters, numbers, underscores, or hyphens.
id: Masukkan "slug" valid yang terdiri dari huruf Unicode, angka, garis bawah atau tanda hubung.
kk: Юникод әріптері, сандар, астын сызу және сызықшалардан тұратын дұрыс "slug" енгізіңіз.
ky: Жарактуу Юникод символ, сан, астыңкы сызык жана дефисти камтыган "slug" киргизиңиз.
vi: Nhập một "slug" hợp lệ bao gồm các chữ cái Unicode, số, dấu gạch dưới hoặc dấu gạch nối.

source: Enter a valid URL.
id: Masukkan URL dengan benar.
kk: Дұрыс URL енгізіңіз.
ky: Жарактуу УРЛ териңиз.
vi: Nhập một địa chỉ URL hợp lệ.

source: Must be a valid UUID.
id: Harus berupa UUID yang valid.
kk: Дұрыс UUID болуы керек.
ky: Жарактуу UUID болушу керек.
vi: Phải là một UUID hợp lệ.

source: Enter a valid IPv4 or IPv6 address.
id: Masukkan alamat IPv4 atau IPv6 dengan benar.
kk: Дұрыс IPv4 немесе IPv6 адрес енгізіңіз.
ky: Жарактуу IPv4 же IPv6 дарек териңиз.
vi: Nhập một địa chỉ IPv4 hoặc IPv6 hợp lệ.

source: A valid integer is required.
id: Diperlukan bilangan bulat yang valid.
kk: Дұрыс бүтін сан енгізілуі қажет.
ky: Жарактуу бүтүн сан керек.
vi: Yêu cầu một số nguyên hợp lệ.

source: Ensure this value is less than or equal to {max_value}.
id: Pastikan nilai ini kurang dari atau sama dengan {max_value}.
kk: Бұл мән {max_value} немесе одан аз болуы керек.
ky: Бул маани {max_value} маанисинен аз же барабар болушу керек.
vi: Đảm bảo giá trị này nhỏ hơn hoặc bằng {max_value}.

source: Ensure this value is greater than or equal to {min_value}.
id: Pastikan nilai ini lebih besar dari atau sama dengan {min_value}.
kk: Бұл мән кемінде {min_value} болуы керек.
ky: Бул маани {min_value} маанисинен көп же барабар болушу керек.
vi: Đảm bảo giá trị này lớn hơn hoặc bằng {min_value}.

source: String value too large.
id: Nilai string terlalu besar.
kk: Жолдың мәні тым үлкен.
ky: Сап мааниси өтө эле узун.
vi: Chuỗi quá lớn.

source: A valid number is required.
id: Diperlukan angka yang valid.
kk: Дұрыс сан енгізілуі керек.
ky: Жарактуу сан талап кылынат.
vi: Yêu cầu một số hợp lệ.

source: Integer value too large to convert to float
kk: Бүтін сан тым үлкен - қалқымалы санға айналдыру мүмкін емес.

source: Ensure that there are no more than {max_digits} digits in total.
id: Pastikan jumlah seluruh digit tidak lebih dari {max_digits}.
kk: Барлығы {max_digits} саннан аспауы керек.
ky: Сандын узундугу эң көп {max_digits} болушу керек.
vi: Đảm bảo không có nhiều hơn {max_digits} chữ số.

source: Ensure that there are no more than {max_decimal_places} decimal places.
id: Pastikan jumlah digit di belakang koma tidak lebih dari {max_decimal_places}.
kk: Ондық бөлшектер саны ең көбі {max_decimal_places} болуы керек.
ky: Сандын бөлчөк узундугу эң көп {max_decimal_places} болушу керек.
vi: Đảm bảo không có nhiều hơn {max_decimal_places} chữ số sau dấu thập phân.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
id: Pastikan jumlah digit tidak lebih dari {max_whole_digits} sebelum koma
kk: Ондық нүктеге дейінгі сандар саны ең көбі {max_whole_digits} болуы керек.
ky: Сандын бүтүн узундугу эң көп {max_whole_digits} болушу керек.
vi: Đảm bảo không có nhiều hơn {max_whole_digits} chữ số trước dấu thập phân.

source: Datetime has wrong format. Use one of these formats instead: {format}.
id: Format tanggal waktu salah. Gunakan salah satu format berikut: {format}.
kk: Datetime пішімі дұрыс емес. Осы пішімдердің бірін пайдаланыңыз: {format}.
ky: Datetime форматы ката. Анын ордуна мына форматтын бирин колдон: {format}.
vi: Ngày và giờ sai định dạng. Dùng một trong những định dạng sau để thay thế: {format}.

source: Expected a datetime but got a date.
id: Mengharapkan tanggal waktu tetapi mendapatkan tanggal.
kk: Күтілгені - datetime, берілгені - date.
ky: datetime күтүлгөн, бирок date алынды
vi: Mong muốn kiểu dữ liệu là datetime nhưng nhận được date.

source: Invalid datetime for the timezone "{timezone}".
id: Tanggal waktu tidak valid untuk zona waktu "{timezone}".
kk: "{timezone}" уақыт белдеуі үшін күн мен уақыт дұрыс емес.
ky: "{timezone}" убакыт белгилөө үчүн жарамсыз күн убакыты.
vi: Giá trị ngày và giờ không hợp lệ cho múi giờ "{timezone}".

source: Datetime value out of range.
id: Nilai tanggal waktu di luar rentang.
kk: Datetime мәні рұқсат етілген ауқымнан тыс.
ky: Күн убакыт чектен ашкан.
vi: Giá trị ngày và giờ nằm ngoài khoảng hợp lệ.

source: Date has wrong format. Use one of these formats instead: {format}.
id: Format tanggal salah. Gunakan salah satu format berikut: {format}.
kk: Date пішімі дұрыс емес. Осы пішімдердің бірін пайдаланыңыз: {format}.
ky: Күн форматы ката. Анын ордуна мына форматтын бирин колдон: {format}.
vi: Ngày sai định dạng. Dùng một trong những định dạng sau để thay thế: {format}.

source: Expected a date but got a datetime.
id: Mengharapkan tanggal tetapi mendapatkan tanggal waktu.
kk: Күтілгені - date, берілгені - datetime.
ky: Date күтүлгөн, бирок datetime алынды.
vi: Mong muốn kiểu dữ liệu là date nhưng nhận được datetime.

source: Time has wrong format. Use one of these formats instead: {format}.
id: Format waktu salah. Gunakan salah satu format berikut: {format}.
kk: Уақыт пішімі дұрыс емес. Осы пішімдердің бірін пайдаланыңыз: {format}.
ky: Убакыт туура эмес форматта. Анын ордуна мына форматтын бирин колдон: {format}.
vi: Thời gian sai định dạng. Dùng một trong những định dạng sau để thay thế: {format}.

source: Duration has wrong format. Use one of these formats instead: {format}.
id: Format durasi salah. Gunakan salah satu format berikut: {format}.
kk: Ұзақтық пішімі дұрыс емес. Осы пішімдердің бірін пайдаланыңыз: {format}.
ky: Туура эмес формат. Анын ордуна мына форматтын бирин колдон: {format}.
vi: Khoảng thời gian sai định dạng. Dùng một trong những định dạng sau để thay thế: {format}.

source: The number of days must be between {min_days} and {max_days}.
kk: Күндер саны {min_days} бен {max_days} аралығында болуы керек.

source: "{input}" is not a valid choice.
id: "{input}" bukan pilihan yang valid.
kk: "{input}" - дұрыс таңдау емес.
ky: "{input}" туура эмес тандоо.
vi: "{input}" không phải một lựa chọn hợp lệ.

source: More than {count} items...
id: Lebih dari {count} item...
kk: {count} элементтен артық...
ky: {count} элементтен көп...
vi: Nhiều hơn {count} phần tử...

source: Expected a list of items but got type "{input_type}".
id: Mengharapkan daftar item tetapi mendapatkan tipe "{input_type}".
kk: Элементтер тізімі күтілді, бірақ "{input_type}" түрі берілген.
ky: Тизме элементи күтүлгөн, бирок "{input_type}" алынды.
vi: Mong muốn kiểu dữ liệu là list nhưng nhận được "{input_type}".

source: This selection may not be empty.
id: Pilihan ini tidak boleh kosong.
kk: Бұл таңдау бос болмауы керек.
ky: Тандоо бош болушу мүмкүн эмес.
vi: Lựa chọn này không được rỗng.

source: "{input}" is not a valid path choice.
id: "{input}" bukan pilihan path yang valid.
kk: "{input}" - дұрыс жол таңдауы емес.
ky: "{input}" файлга туура эмес жол тандалды.
vi: "{input}" không phải một lựa chọn đường dẫn hợp lệ.

source: No file was submitted.
id: Tidak ada file yang dikirimkan.
kk: Файл жіберілмеді.
ky: Бир да файл тандалган жок.
vi: Không có tệp tin nào được gửi.

source: The submitted data was not a file. Check the encoding type on the form.
id: Data yang dikirimkan bukan file. Periksa jenis encoding pada form.
kk: Жіберілген деректер файл емес. Формадағы кодтау түрін тексеріңіз.
ky: Жөнөтүлгөн берилиш файл эмес. Форманын коддоо тибин текшериңиз.
vi: Dữ liệu đã gửi không phải một tệp tin. Kiểm tra loại mã hóa ở trên form.

source: No filename could be determined.
id: Tidak ada nama file yang dapat ditentukan.
kk: Файл атауы анықталмады.
ky: Файл аты аныкталбады.
vi: Không thể xác định tên tệp tin.

source: The submitted file is empty.
id: File yang dikirimkan kosong.
kk: Жіберілген файл бос.
ky: Жөнөтүлгөн файл бош.
vi: Tệp tin đã gửi rỗng.

source: Ensure this filename has at most {max_length} characters (it has {length}).
id: Pastikan nama file ini paling banyak memiliki {max_length} karakter (memiliki {length}).
kk: Файл атауы {max_length} таңбадан аспауы керек (қазір - {length}).
ky: Файлдын атынын узундугу эң көп {max_length} символ болушу керек. (азыркысы: {length}).
vi: Đảm bảo tên tệp tin có nhiều nhất {max_length} ký tự (chiều dài hiện tại {length}).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
id: Unggah gambar yang valid. File yang anda unggah bukan gambar atau gambar rusak.
kk: Дұрыс кескін жүктеңіз. Жүктелген файл кескін емес немесе бүлінген.
ky: Жарактуу сүрөт жүктө. Жөнөтүлгөн файл сүрөт эмес же бузулган сүрөт.
vi: Tải lên ảnh hợp lệ. Tệp tin đã tải lên không phải ảnh hoặc là một tệp tin ảnh bị hỏng.

source: This list may not be empty.
id: Daftar ini tidak boleh kosong.
kk: Бұл тізім бос болмауы керек.
ky: Бул тизме бош болушу мүмкүн эмес.
vi: Danh sách này không thể để trống.

source: Ensure this field has at least {min_length} elements.
id: Pastikan bidang ini memiliki setidaknya {min_length} elemen.
kk: Бұл мәнде кемінде {min_length} элемент болуы керек.
ky: Бул талаа эң аз {min_length} узундукта болушу керек.
vi: Đảm bảo trường này có ít nhất {min_length} phần tử.

source: Ensure this field has no more than {max_length} elements.
id: Pastikan bidang ini memiliki tidak lebih dari {max_length} elemen.
kk: Бұл мәнде {max_length} элементтен көп болмауы керек.
ky: Бул тизме эң көп {max_length} элемент камтышы керек.
vi: Đảm bảo trường này có nhiều nhất {max_length} phần tử.

source: Expected a dictionary of items but got type "{input_type}".
id: mengharapkan dictionary dari item tetapi mendapat tipe "{input_type}.
kk: Элементтер жиыны ретінде сөздік күтілді, бірақ "{input_type}" түрі берілген.
ky: Сөздүк элементи күтүлгөн, бирок "{input_type}" алынды.
vi: Mong muốn kiểu dữ liệu là dictionary nhưng nhận được "{input_type}".

source: This dictionary may not be empty.
id: Dictionary ini tidak boleh kosong
kk: Бұл сөздік бос болмауы керек.
ky: Сөздүк бош болушу мүмкүн эмес.
vi: Từ điển không được rỗng.

source: Value must be valid JSON.
id: Nilai harus berupa JSON yang valid.
kk: Мән дұрыс JSON пішімінде болуы керек.
ky: Маани жарактуу JSON болушу керек.
vi: Giá trị bắt buộc phải là định dạng JSON.

source: Search
id: Cari
kk: Іздеу
ky: Издөө
vi: Tìm kiếm

source: A search term.
id: Istilah pencarian.
kk: Іздеу сөзі.
ky: Издөө термини
vi: Cụm từ tìm kiếm.

source: Ordering
id: Pengurutan
kk: Реттеу
ky: Иреттөө
vi: Sắp xếp

source: Which field to use when ordering the results.
id: Bidang mana yang akan digunakan saat mengurutkan hasil.
kk: Нәтижелерді реттеу үшін қай мән пайдалану керектігін көрсетеді.
ky: Жыйынтыкты иреттөөдө колдонулган талаа.
vi: Trường nào được sử dụng khi sắp xếp kết quả.

source: ascending
id: naik
kk: өсу ретімен
ky: өсүү
vi: tăng dần

source: descending
id: turun
kk: кему ретімен
ky: кемүү
vi: giảm dần

source: A page number within the paginated result set.
id: Nomor halaman dalam kumpulan hasil paginasi.
kk: Беттелген нәтиже жиынындағы бет нөмірі.
ky: Беттелген жыйынтыктын бет номуру.
vi: Số thứ tự của trang trong tập kết quả đã được phân trang.

source: Number of results to return per page.
id: Jumlah hasil untuk dikembalikan per halaman.
kk: Әр бетте қайтарылатын нәтиже саны.
ky: Бир бетке кайтарылган жыйынтык саны.
vi: Số lượng kết quả trả về ở mỗi trang.

source: Invalid page.
id: Halaman tidak valid.
kk: Қате бет нөмірі.
ky: Жарамсыз бет.
vi: Trang không hợp lệ.

source: The initial index from which to return the results.
id: Indeks awal dari mana untuk mengembalikan hasil.
kk: Нәтижелер қайтарылатын бастапқы индекс.
ky: Кайтарылчуу жыйынтыктын башталгыч индекси.
vi: Chỉ mục ban đầu để trả về kết quả.

source: The pagination cursor value.
id: Nilai kursor paginasi.
kk: Нәтижелерді беттеуге арналған курсор мәні.
ky: Беттөө курсор мааниси.
vi: Giá trị của con trỏ phân trang.

source: Invalid cursor
id: Kursor tidak valid
kk: Қате курсор
ky: Туура эмес курсор.
vi: Con trỏ không hợp lệ.

source: Invalid pk "{pk_value}" - object does not exist.
id: pk tidak valid "{pk_value}" - objek tidak ada.
kk: Қате pk "{pk_value}" - нысан табылмады.
ky: Жарамсыз pk "{pk_value}" - объект табылбады.
vi: Giá trị pk không hợp lệ "{pk_value}" - đối tượng không tồn tại.

source: Incorrect type. Expected pk value, received {data_type}.
id: Tipe salah. Mengharapkan nilai pk, menerima {data_type}.
kk: Дерек түрі дұрыс емес. Күтілгені - pk мәні, берілгені - {data_type}.
ky: Туура эмес тип. pk мааниси күтүлгөн, {data_type} алынды.
vi: Kiểu dữ liệu không đúng. Mong muốn giá trị pk nhưng nhận được {data_type}.

source: Invalid hyperlink - No URL match.
id: Hyperlink tidak valid - Tidak ada URL yang cocok.
kk: Қате гиперсілтеме - URL сәйкестігі жоқ.
ky: Гипершилтеме жарамсыз - URL табылбады.
vi: Đường liên kết không hợp lệ - Không có URL nào trùng.

source: Invalid hyperlink - Incorrect URL match.
id: Hyperlink tidak valid - Pencocokan URL salah.
kk: Қате гиперсілтеме - URL сәйкестігі дұрыс емес.
ky: Гипершилтеме жарамсыз - URL шайкеш келбеди.
vi: Đường liên kết không hợp lệ - URL không đúng định dạng.

source: Invalid hyperlink - Object does not exist.
id: Hyperlink tidak valid - Objek tidak ada.
kk: Қате гиперсілтеме - нысан табылмады.
ky: Жарамсыз гипершилтеме - объект табылбады.
vi: Đường liên kết không hợp lệ - Đối tượng không tồn tại.

source: Incorrect type. Expected URL string, received {data_type}.
id: Tipe salah. Mengharapkan string URL, menerima {data_type}.
kk: Дерек түрі дұрыс емес. Күтілгені - URL жолы, берілгені - {data_type}
ky: Туура эмес тип. URL сабы күтүлгөн, {data_type} алынды.
vi: Kiểu dữ liệu không đúng. Mong muốn chuỗi URL nhưng nhận được {data_type}.

source: Object with {slug_name}={value} does not exist.
id: Objek dengan {slug_name}={value} tidak ada.
kk: {slug_name}={value} параметрі бар нысан табылмады.
ky: {slug_name}={value} менен объект табылбады.
vi: Đối tượng {slug_name}={value} không tồn tại.

source: Invalid value.
id: Nilai tidak valid
kk: Қате мән.
ky: Туура эмес маани.
vi: Giá trị không hợp lệ.

source: unique integer value
id: nilai bilangan bulat unik
kk: бірегей бүтін сан мәні
ky: уникалдуу натуралдык сан мааниси
vi: giá trị số nguyên duy nhất

source: UUID string
id: String UUID
kk: UUID жолы
ky: UUID сабы
vi: chuỗi UUID

source: unique value
id: nilai unik
kk: бірегей мән
ky: уникалдуу маани
vi: giá trị duy nhất

source: A {value_type} identifying this {name}.
id: Sebuah {value_type} yang mengidentifikasi {name} ini.
kk: {name} нысанын анықтайтын {value_type}.
ky: {value_type} бул {name} аныктайт.
vi: Một {value_type} xác định {name} này.

source: Invalid data. Expected a dictionary, but got {datatype}.
id: Data tidak valid. Mengharapkan dictionary, tetapi mendapatkan {datatype}.
kk: Деректер қате. Күтілгені - сөздік түрі, берілгені - {datatype}.
ky: Жарамсыз берилиш. Сөздүк күтүлгөн, бирок {datatype} табылды.
vi: Dữ liệu không hợp lệ. Mong muốn một dictionary nhưng nhận được {datatype}.

source: Extra Actions
id: Tindakan Ekstra
kk: Қосымша әрекеттер
ky: Кошумча аракеттер
vi: Các hành động bổ sung

source: Filters
id: Filter
kk: Сүзгілер
ky: Чыпкалар
vi: Bộ lọc
